Amiya200/stm32_water_tank/Core/Src/screen.c
    }
    else if (dash_page == 1)
    {
        snprintf(l0, sizeof(l0), "Date:%02u-%02u-%02u",
                 time.dom,
                 time.month,
                 (uint8_t)(time.year % 100));
        snprintf(l1, sizeof(l1), "Time:%02u:%02u:%02u",
                 time.hour,
                 time.min,
                 time.sec);
    }
    else
    {
        snprintf(l0, sizeof(l0), "V:%3.0fV  I:%3.1fA",
                 g_voltageV,
                 g_currentA);
        if (ModelHandle_IsOverload())
            snprintf(l1, sizeof(l1), "OVER LOAD!");
        else if (ModelHandle_IsUnderload())
            snprintf(l1, sizeof(l1), "UNDER LOAD!");
        else if (ModelHandle_IsVoltageFault())
            snprintf(l1, sizeof(l1), "VOLT Error!");
        else
            snprintf(l1, sizeof(l1), "Live Monitor");
    }
    lcd_line0(l0);
    lcd_line1(l1);
}
static void draw_menu_cursor(void)
{
    if (ui != UI_MENU) return;
    uint8_t row = 255;
    if      (menu_idx == menu_view_top)     row = 0;
    else if (menu_idx == menu_view_top + 1) row = 1;
    if (row <= 1)
    {
        lcd_put_cur(row,0);
        lcd_send_data(cursorVisible ? '>' : ' ');
    }
}
static void show_menu(void)
{
    char l0[17], l1[17];
    if (menu_idx < menu_view_top)
        menu_view_top = menu_idx;
    else if (menu_idx > menu_view_top + 1)
        menu_view_top = menu_idx - 1;
    snprintf(l0, sizeof(l0), " %-15.15s", main_menu[menu_view_top]);
    if (menu_view_top + 1 < MAIN_MENU_COUNT)
        snprintf(l1, sizeof(l1), " %-15.15s", main_menu[menu_view_top + 1]);
    else
        snprintf(l1, sizeof(l1), "                ");
    lcd_line0(l0);
    lcd_line1(l1);
    draw_menu_cursor();
}
static void show_devset_menu(void)
{
    char l0[17], l1[17];
    if (devset_idx < devset_view_top)
        devset_view_top = devset_idx;
    else if (devset_idx > devset_view_top + 1)
        devset_view_top = devset_idx - 1;
    uint8_t idx0 = devset_view_top;
    uint8_t idx1 = devset_view_top + 1;
    char star0 = ' ';
    char star1 = ' ';
    if (idx0 == 0 && edit_settings_gap_s > 0)     star0 = '*';
    if (idx0 == 1 && edit_settings_retry > 0)     star0 = '*';
    if (idx0 == 2 && edit_settings_uv > 0)        star0 = '*';
    if (idx0 == 3 && edit_settings_ov > 0)        star0 = '*';
    if (idx0 == 4 && edit_settings_ol > 0)        star0 = '*';
    if (idx0 == 5 && edit_settings_ul > 0)        star0 = '*';
    if (idx0 == 6 && edit_settings_maxrun > 0)    star0 = '*';
    if (idx1 == 0 && edit_settings_gap_s > 0)     star1 = '*';
    if (idx1 == 1 && edit_settings_retry > 0)     star1 = '*';
    if (idx1 == 2 && edit_settings_uv > 0)        star1 = '*';
    if (idx1 == 3 && edit_settings_ov > 0)        star1 = '*';
    if (idx1 == 4 && edit_settings_ol > 0)        star1 = '*';
    if (idx1 == 5 && edit_settings_ul > 0)        star1 = '*';
    if (idx1 == 6 && edit_settings_maxrun > 0)    star1 = '*';
    if (idx0 < DEVSET_MENU_COUNT)
        snprintf(l0, sizeof(l0), "%c%c%-14.14s",
                 (devset_idx == idx0 ? '>' : ' '),
                 star0,
                 devset_menu_items[idx0]);
    else
        snprintf(l0, sizeof(l0), "                ");
    if (idx1 < DEVSET_MENU_COUNT)
        snprintf(l1, sizeof(l1), "%c%c%-14.14s",
                 (devset_idx == idx1 ? '>' : ' '),
                 star1,
                 devset_menu_items[idx1]);
    else
        snprintf(l1, sizeof(l1), "                ");
    lcd_line0(l0);
    lcd_line1(l1);
}
static void show_timer_slot_select(void)
{
    lcd_clear();
    int item1 = timer_page * 2;
    int item2 = item1 + 1;
    char l0[17], l1[17];
    if (item1 == 5) {
        snprintf(l0, sizeof(l0), "%c Back",
                 (currentSlot == 5 ? '>' : ' '));
    }
    else {
        snprintf(l0, sizeof(l0), "%c Timer %d",
                 (currentSlot == item1 ? '>' : ' '),
                 item1 + 1);
    }
    if (item2 <= 5)
    {
        if (item2 == 5) {
            snprintf(l1, sizeof(l1), "%c Back",
                     (currentSlot == 5 ? '>' : ' '));
        } else {
            snprintf(l1, sizeof(l1), "%c Timer %d",
                     (currentSlot == item2 ? '>' : ' '),
                     item2 + 1);
        }
    }
    else {
        snprintf(l1, sizeof(l1), "                ");
    }
    lcd_line0(l0);
    lcd_line1(l1);
}
static void show_edit_on_time(void)
{
    char title[17];
    snprintf(title, sizeof(title), "T%u On Time", (unsigned)(currentSlot + 1));
    lcd_line0(title);

    char buf[17];
    if (time_edit_field == 0)
        snprintf(buf, sizeof(buf), "[%02d]:%02d   Next>", edit_on_h, edit_on_m);
    else
        snprintf(buf, sizeof(buf), "%02d:[%02d]   Next>", edit_on_h, edit_on_m);

    lcd_line1(buf);
}
static void show_edit_off_time(void)
{
    char title[17];
    snprintf(title, sizeof(title), "T%u Off Time", (unsigned)(currentSlot + 1));
    lcd_line0(title);
    char buf[17];
    if (time_edit_field == 0)
        snprintf(buf, sizeof(buf), "[%02d]:%02d   Next>", edit_off_h, edit_off_m);
    else
        snprintf(buf, sizeof(buf), "%02d:[%02d]   Next>", edit_off_h, edit_off_m);
    lcd_line1(buf);
}
static const char* dayNames[] = {
    "Enable All", "Disable All",
    "Mon", "Tue", "Wed", "Thu", "Fri", "Sat", "Sun",
    "Next>"
};
static void show_timer_days(void)
{
    lcd_line0("Timer Days");
    char buf[17];
    if (edit_day_index >= 2 && edit_day_index <= 8)
        {
            uint8_t d = edit_day_index - 2;
            uint8_t isOn = (edit_day_mask >> d) & 1;
            snprintf(buf,sizeof(buf),"> %s (%s)", dayNames[edit_day_index], isOn?"ON":"OFF");
        }
        else
        {
            snprintf(buf,sizeof(buf),"> %s", dayNames[edit_day_index]);
        }
    lcd_line1(buf);
}
static void show_timer_gap(void)
{
    lcd_line0("Timer Gap (min)");

    char buf[17];
    snprintf(buf, sizeof(buf), ">T%u %3u min Next>",
             (unsigned)(currentSlot + 1),
             (unsigned)edit_gap_min);

    lcd_line1(buf);
}
static void show_timer_enable(void)
{
    char title[17];
    snprintf(title, sizeof(title), "T%u Enable?",
             (unsigned)(currentSlot + 1));
    lcd_line0(title);
    lcd_line1(edit_slot_enabled ? "YES       Next>" :
                                  "NO        Next>");
}
static void show_timer_summary(void)
{
    char title[17];
    snprintf(title, sizeof(title), "T%u Summary",
             (unsigned)(currentSlot + 1));
    lcd_line0(title);
    if (edit_slot_enabled)
        lcd_line1("Enabled     Next>");
    else
        lcd_line1("Disabled    Next>");
}
static void show_auto_menu(void)
{
    lcd_line0("Auto Settings");
    lcd_line1(">Gap/Max/Retry");
}
static void show_auto_gap(void){
    lcd_line0("DRY GAP (s)");
    char buf[17]; snprintf(buf,sizeof(buf),"val:%03u Next>",edit_auto_gap_s);
    lcd_line1(buf);
}
static void show_auto_maxrun(void){
    lcd_line0("MAX RUN (min)");
    char buf[17]; snprintf(buf,sizeof(buf),"val:%03u Next>",edit_auto_maxrun_min);
    lcd_line1(buf);
}
static void show_auto_retry(void){
    lcd_line0("RETRY COUNT");
    char buf[17]; snprintf(buf,sizeof(buf),"val:%03u Next>",edit_auto_retry);
    lcd_line1(buf);
}
static void show_semi_auto(void)
{
    lcd_line0("Semi-Auto");
    lcd_line1(semiAutoActive ? "val:Disable Next>"
                             : "val:Enable  Next>");
}
static void show_twist(void)
{
    char l0[17];
    snprintf(l0,sizeof(l0),"Tw %02us/%02us",
             (unsigned)twistSettings.onDurationSeconds,
             (unsigned)twistSettings.offDurationSeconds);
    lcd_line0(l0);
    lcd_line1(twistActive ?  "val:STOP   Next>" :
                            "val:START  Next>");
}
static void show_twist_on_sec(void){
    lcd_line0("TWIST ON SEC");
    char buf[17]; snprintf(buf,sizeof(buf),"val:%03u Next>",edit_twist_on_s);
    lcd_line1(buf);
}
static void show_twist_off_sec(void){
    lcd_line0("TWIST OFF SEC");
    char buf[17]; snprintf(buf,sizeof(buf),"val:%03u Next>",edit_twist_off_s);
    lcd_line1(buf);
}
static void show_twist_on_h(void){
    lcd_line0("TWIST ON HH");
    char buf[17]; snprintf(buf,sizeof(buf),"val:%03u Next>",edit_twist_on_hh);
    lcd_line1(buf);
}
static void show_twist_on_m(void){
    lcd_line0("TWIST ON MM");
    char buf[17]; snprintf(buf,sizeof(buf),"val:%03u Next>",edit_twist_on_mm);
    lcd_line1(buf);
}
static void show_twist_off_h(void){
    lcd_line0("TWIST OFF HH");
    char buf[17]; snprintf(buf,sizeof(buf),"val:%03u Next>",edit_twist_off_hh);
    lcd_line1(buf);
}
static void show_twist_off_m(void){
    lcd_line0("TWIST OFF MM");
    char buf[17]; snprintf(buf,sizeof(buf),"val:%03u Next>",edit_twist_off_mm);
    lcd_line1(buf);
}
static void show_countdown(void)
{
    char l0[17], l1[17];
    if (countdownActive)
    {
        uint32_t sec = countdownDuration;
        uint32_t min = sec / 60;
        uint32_t s   = sec % 60;
        snprintf(l0,sizeof(l0),"CD %02lu:%02lu RUN",
                 (unsigned long)min, (unsigned long)s);
        snprintf(l1,sizeof(l1),"Press to STOP");
    }
    else
    {
        snprintf(l0,sizeof(l0),"CD Set:%3u min",edit_countdown_min);
        snprintf(l1,sizeof(l1),"Press to START");
    }
    lcd_line0(l0);
    lcd_line1(l1);
}
static void show_countdown_edit_min(void){
    lcd_line0("SET MINUTES");
    char buf[17]; snprintf(buf,sizeof(buf),"val:%03u Next>",edit_countdown_min);
    lcd_line1(buf);
}
static void show_settings_gap(void){
    lcd_line0("Set Dry Run");
    char buf[17];
    if (edit_settings_gap_s == 0)
        snprintf(buf,sizeof(buf),"Disable    Next>");
    else
        snprintf(buf,sizeof(buf),"val:%2umin Next>", edit_settings_gap_s);
    lcd_line1(buf);
}
static void show_settings_retry(void){
    lcd_line0("Testing Gap");
    char buf[17];
    if (edit_settings_retry == 0)
        snprintf(buf,sizeof(buf),"Disable    Next>");
    else
        snprintf(buf,sizeof(buf),"val:%3umin Next>", edit_settings_retry);
    lcd_line1(buf);
}
static void show_settings_uv(void){
    lcd_line0("Low Volt");
    char buf[17];
    if (edit_settings_uv == 0)
        snprintf(buf,sizeof(buf),"Disable    Next>");
    else
        snprintf(buf,sizeof(buf),"val:%3uV Next>", edit_settings_uv);
    lcd_line1(buf);
}
static void show_settings_ov(void){
    lcd_line0("High Volt");
    char buf[17];
    if (edit_settings_ov == 0)
        snprintf(buf,sizeof(buf),"Disable    Next>");
    else
        snprintf(buf,sizeof(buf),"val:%3uV Next>", edit_settings_ov);
    lcd_line1(buf);
}
static void show_settings_ol(void){
    lcd_line0("Over Load (A)");
    char buf[17];
    if (edit_settings_ol < 1)
        snprintf(buf, sizeof(buf), "Disable    Next>");
    else
        snprintf(buf, sizeof(buf), "val:%3d Next>", edit_settings_ol);
    lcd_line1(buf);
}
static void show_settings_ul(void){
    lcd_line0("Under Load (A)");
    char buf[17];
    if (edit_settings_ul < 1)
        snprintf(buf, sizeof(buf), "Disable    Next>");
    else
        snprintf(buf, sizeof(buf), "val:%3d Next>", edit_settings_ul);
    lcd_line1(buf);
}
static void show_settings_maxrun(void){
    lcd_line0("Max Run");
    char buf[17];
    if (edit_settings_maxrun == 0)
        snprintf(buf,sizeof(buf),"Disable    Next>");
    else
        snprintf(buf,sizeof(buf),"val:%3umin Next>",edit_settings_maxrun);
    lcd_line1(buf);
}
static void show_settings_pwrrest(void){
    lcd_line0("Power Restore");
    const char* text =
        (edit_settings_pwrrest == 0) ? "YES       Next>" :
        (edit_settings_pwrrest == 1) ? "NO        Next>" :
                                       "LAST      Next>";
    lcd_line1(text);
}
static void show_settings_factory(void){
    lcd_line0("Factory Reset?");
    lcd_line1(edit_settings_factory_yes ? "YES       Next>" :
                                         "NO        Next>");
}
static void show_devset_edit_date(void)
{
    lcd_line0("Set Date");
    uint8_t yy2 = (uint8_t)(edit_date_yyyy % 100);
    char buf[17];
    if (edit_date_field == 0)
        snprintf(buf,sizeof(buf),"[%02u]-%02u-%02u", edit_date_dd, edit_date_mm, yy2);
    else if (edit_date_field == 1)
        snprintf(buf,sizeof(buf),"%02u-[%02u]-%02u", edit_date_dd, edit_date_mm, yy2);
    else
        snprintf(buf,sizeof(buf),"%02u-%02u-[%02u]", edit_date_dd, edit_date_mm, yy2);
    lcd_line1(buf);
}
static void show_devset_edit_time(void)
{
    lcd_line0("Set Time");
    char buf[17];

    if (edit_time_field == 0)
        snprintf(buf,sizeof(buf),"[%02u]:%02u", edit_time_hh, edit_time_min);
    else
        snprintf(buf,sizeof(buf),"%02u:[%02u]", edit_time_hh, edit_time_min);

