Amiya200/stm32_water_tank/Core/Src/screen.c
    lcd_line1(buf);
}
static void show_devset_edit_day(void)
{
    lcd_line0("Set Day");
    char buf[17];
    snprintf(buf,sizeof(buf),"> %s", dowNames[edit_day_idx2 % 7]);
    lcd_line1(buf);
}
static void show_add_device_menu(void)
{
    lcd_line0(addDevMenuIndex == 0 ? ">Pair Device" : " Pair Device");
    lcd_line1(addDevMenuIndex == 1 ? ">Remove Device" : " Remove Device");
}
static void show_add_device_pair(void)
{
    lcd_line0("Pair Device");
    char buf[17];
    snprintf(buf,sizeof(buf),">%s", addDevTypeNames[addDevTypeIndex]);
    lcd_line1(buf);
}
static void show_add_device_remove(void)
{
    lcd_line0("Remove Device");
    char buf[17];
    snprintf(buf,sizeof(buf),">%s", addDevTypeNames[addDevTypeIndex]);
    lcd_line1(buf);
}
static void show_add_device_pair_done(void)
{
    lcd_line0("Paired Device");
    char buf[17];
    snprintf(buf,sizeof(buf),"%s   OK>", addDevTypeNames[lastAddDevType]);
    lcd_line1(buf);
}
static void show_add_device_remove_done(void)
{
    lcd_line0("Removed Device");
    char buf[17];
    snprintf(buf,sizeof(buf),"%s   OK>", addDevTypeNames[lastAddDevType]);
    lcd_line1(buf);
}
static void show_reset_confirm(void)
{
    lcd_line0("Reset To Default?");
    lcd_line1(reset_confirm_yes ? "YES       Apply>" :
                                  "NO        Back>");
}
static void apply_timer_slot(void)
{
    TimerSlot *t = &timerSlots[currentSlot];
    t->onHour    = edit_on_h;
    t->onMinute  = edit_on_m;
    t->offHour   = edit_off_h;
    t->offMinute = edit_off_m;
    t->dayMask   = edit_day_mask;
    t->gapMinutes = edit_gap_min;
    t->enabled = edit_slot_enabled;

    extern void ModelHandle_TimerRecalculateNow(void);
    ModelHandle_TimerRecalculateNow();
}
static void apply_auto_settings(void)
{
    ModelHandle_SetAutoSettings(
        edit_auto_gap_s,
        edit_auto_maxrun_min,
        edit_auto_retry
    );
}
static void apply_settings_core(void)
{
    uint16_t gap_s = 0;
    if (edit_settings_gap_s > 0)
        gap_s = (uint16_t)(edit_settings_gap_s * 60U);
    ModelHandle_SetUserSettings(
        gap_s,
        edit_settings_retry,
        edit_settings_uv,
        edit_settings_ov,
        edit_settings_ol,
        edit_settings_ul,
        edit_settings_maxrun
    );
}
static void start_settings_edit_flow(void)
{
    uint16_t gap_s = ModelHandle_GetGapTime();
    if (gap_s == 0) {
        edit_settings_gap_s = 0;
    } else {
        edit_settings_gap_s = gap_s / 60;
        if (edit_settings_gap_s < 1)  edit_settings_gap_s = 1;
        if (edit_settings_gap_s > 15) edit_settings_gap_s = 15;
    }
    edit_settings_retry   = ModelHandle_GetRetryCount();
    if (edit_settings_retry > 180)
        edit_settings_retry = 180;
    edit_settings_uv      = ModelHandle_GetUnderVolt();
    if (edit_settings_uv != 0) {
        if (edit_settings_uv < 150) edit_settings_uv = 150;
        if (edit_settings_uv > 200) edit_settings_uv = 200;
    }
    edit_settings_ov      = ModelHandle_GetOverVolt();
    if (edit_settings_ov != 0) {
        if (edit_settings_ov < 250) edit_settings_ov = 250;
        if (edit_settings_ov > 300) edit_settings_ov = 300;
    }
    edit_settings_ol      = ModelHandle_GetOverloadLimit();
    if (edit_settings_ol > 25.0f) edit_settings_ol = 25.0f;
    edit_settings_ul      = ModelHandle_GetUnderloadLimit();
    if (edit_settings_ul > 10.0f) edit_settings_ul = 10.0f;
    edit_settings_maxrun  = ModelHandle_GetMaxRunTime();
    if (edit_settings_maxrun > 300) edit_settings_maxrun = 300;
    edit_settings_pwrrest = ModelHandle_GetPowerRestoreMode();
    edit_settings_factory_yes = 0;
    RTC_GetTimeDate();
    edit_date_dd    = time.dom;
    edit_date_mm    = time.month;
    edit_date_yyyy  = time.year;
    edit_date_field = 0;
    edit_time_hh    = time.hour;
    edit_time_min   = time.min;
    edit_time_field = 0;
    if (time.dow >= 1 && time.dow <= 7)
        edit_day_idx2 = (uint8_t)((time.dow - 1) % 7);
    else
        edit_day_idx2 = 0;
    devset_idx      = 0;
    devset_view_top = 0;
    ui = UI_DEVSET_MENU;
    screenNeedsRefresh = true;
}
static void goto_menu_top(void)
{
    menu_idx = 0;
    menu_view_top = 0;
}
static void menu_select(void)
{
    refreshInactivityTimer();

    /* =========================================================
       WELCOME → DASH
       ========================================================= */
    if (ui == UI_WELCOME)
    {
        ui = UI_DASH;
        screenNeedsRefresh = true;
        return;
    }

    /* =========================================================
       DASH → MENU
       ========================================================= */
    if (ui == UI_DASH)
    {
        goto_menu_top();
        ui = UI_MENU;
        screenNeedsRefresh = true;
        return;
    }

    /* =========================================================
       MAIN MENU
       ========================================================= */
    if (ui == UI_MENU)
    {
        switch(menu_idx)
        {
            case 0: // Add Device
                addDevMenuIndex = 0;
                addDevTypeIndex = 0;
                ui = UI_ADD_DEVICE_MENU;
                break;

            case 1: // Device Setup
                start_settings_edit_flow();
                return;

            case 2: // Reset To Default
                reset_confirm_yes = false;
                ui = UI_RESET_CONFIRM;
                break;
        }

        screenNeedsRefresh = true;
        return;
    }

    /* =========================================================
       DEVICE SETUP MENU  ⭐ FIXED SECTION
       SELECT = Enable / Disable OR Enter Sub Screen
       ========================================================= */
    if (ui == UI_DEVSET_MENU)
    {
        switch(devset_idx)
        {
            case 0: // Dry Run
                edit_settings_gap_s = (edit_settings_gap_s > 0) ? 0 : 5;
                apply_settings_core();
                break;

            case 1: // Testing Gap
                edit_settings_retry = (edit_settings_retry > 0) ? 0 : 5;
                apply_settings_core();
                break;

            case 2: // Low Volt
                edit_settings_uv = (edit_settings_uv > 0) ? 0 : 180;
                apply_settings_core();
                break;

            case 3: // High Volt
                edit_settings_ov = (edit_settings_ov > 0) ? 0 : 260;
                apply_settings_core();
                break;

            case 4: // Over Load
                edit_settings_ol = (edit_settings_ol > 0) ? 0 : 6;
                apply_settings_core();
                break;

