Amiya200/stm32_water_tank/Core/Src/screen.c
            case 5: // Under Load
                edit_settings_ul = (edit_settings_ul > 0) ? 0 : 2;
                apply_settings_core();
                break;

            case 6: // Max Run
                edit_settings_maxrun = (edit_settings_maxrun > 0) ? 0 : 60;
                apply_settings_core();
                break;

            case 7: // Set Date
                ui = UI_DEVSET_EDIT_DATE;
                break;

            case 8: // Set Time
                ui = UI_DEVSET_EDIT_TIME;
                break;

            case 9: // Set Day
                ui = UI_DEVSET_EDIT_DAY;
                break;

            case 10: // Power Restore
                edit_settings_pwrrest = (edit_settings_pwrrest + 1) % 3;
                ModelHandle_SetPowerRestoreMode(edit_settings_pwrrest);
                break;

            case 11: // Factory Reset
                edit_settings_factory_yes ^= 1;
                if (edit_settings_factory_yes)
                {
                    ModelHandle_FactoryReset();
                    ui = UI_DASH;
                }
                break;

            case 12: // Back
                ui = UI_MENU;
                break;

            default:
                break;
        }

        screenNeedsRefresh = true;
        return;
    }

    /* =========================================================
       DATE EDIT
       ========================================================= */
    if (ui == UI_DEVSET_EDIT_DATE)
    {
        if (edit_date_field < 2)
        {
            edit_date_field++;
        }
        else
        {
            time.dom   = edit_date_dd;
            time.month = edit_date_mm;
            time.year  = edit_date_yyyy;

            RTC_SetTimeDate(
                time.sec,
                time.min,
                time.hour,
                time.dow,
                time.dom,
                time.month,
                time.year
            );


            ui = UI_DEVSET_MENU;
        }

        screenNeedsRefresh = true;
        return;
    }
    if (ui == UI_DEVSET_EDIT_TIME)
    {
        if (edit_time_field == 0)
        {
            edit_time_field = 1;
        }
        else
        {
            time.hour = edit_time_hh;
            time.min  = edit_time_min;
            time.sec  = 0;
            RTC_SetTimeDate(
                time.sec,
                time.min,
                time.hour,
                time.dow,
                time.dom,
                time.month,
                time.year
            );

            ui = UI_DEVSET_MENU;
        }

        screenNeedsRefresh = true;
        return;
    }
    if (ui == UI_DEVSET_EDIT_DAY)
    {
        time.dow = edit_day_idx2 + 1;
        RTC_SetTimeDate(
            time.sec,
            time.min,
            time.hour,
            time.dow,
            time.dom,
            time.month,
            time.year
        );
        ui = UI_DEVSET_MENU;
        screenNeedsRefresh = true;
        return;
    }


    /* =========================================================
       RESET CONFIRM
       ========================================================= */
    if (ui == UI_RESET_CONFIRM)
    {
        if (reset_confirm_yes)
        {
            ModelHandle_FactoryReset();
        }

        ui = UI_DASH;
        screenNeedsRefresh = true;
        return;
    }

    /* =========================================================
       (Your Existing Timer Edit Flow Continues Below)
       ========================================================= */
}
void increase_edit_value(void)
{
    switch(ui)
    {
        case UI_TIMER_EDIT_ON_TIME:
            if (time_edit_field == 0) {
                if (edit_on_h <= 18) edit_on_h += 5;
                else edit_on_h = 23;
            } else {
                if (edit_on_m <= 54) edit_on_m += 5;
                else edit_on_m = 59;
            }
            break;

        case UI_TIMER_EDIT_OFF_TIME:
            if (time_edit_field == 0) {
                if (edit_off_h <= 18) edit_off_h += 5;
                else edit_off_h = 23;
            } else {
                if (edit_off_m <= 54) edit_off_m += 5;
                else edit_off_m = 59;
            }
            break;

        case UI_TIMER_EDIT_GAP:
            if (edit_gap_min <= 235) edit_gap_min += 5;
            else edit_gap_min = 240;
            break;

        case UI_AUTO_EDIT_GAP:        edit_auto_gap_s += 5;      break;
        case UI_AUTO_EDIT_MAXRUN:     edit_auto_maxrun_min += 5; break;
        case UI_AUTO_EDIT_RETRY:      edit_auto_retry += 5;      break;

        case UI_TWIST_EDIT_ON:        edit_twist_on_s += 5;      break;
        case UI_TWIST_EDIT_OFF:       edit_twist_off_s += 5;     break;

        case UI_TWIST_EDIT_ON_H:
            if (edit_twist_on_hh <= 18) edit_twist_on_hh += 5;
            else edit_twist_on_hh = 23;
            break;

        case UI_TWIST_EDIT_ON_M:
            if (edit_twist_on_mm <= 54) edit_twist_on_mm += 5;
            else edit_twist_on_mm = 59;
            break;

        case UI_TWIST_EDIT_OFF_H:
            if (edit_twist_off_hh <= 18) edit_twist_off_hh += 5;
            else edit_twist_off_hh = 23;
            break;

        case UI_TWIST_EDIT_OFF_M:
            if (edit_twist_off_mm <= 54) edit_twist_off_mm += 5;
            else edit_twist_off_mm = 59;
            break;

        /* 🚫 REMOVED: UI_COUNTDOWN_EDIT_MIN
           Countdown edit is handled ONLY in Screen_HandleSwitches() */

        case UI_SETTINGS_GAP:
            if (edit_settings_gap_s <= 10) edit_settings_gap_s += 5;
            else edit_settings_gap_s = 15;
            break;

        case UI_SETTINGS_RETRY:
            if (edit_settings_retry <= 175) edit_settings_retry += 5;
            else edit_settings_retry = 180;
            break;

        case UI_SETTINGS_UV:
            if (edit_settings_uv == 0) edit_settings_uv = 150;
            else if (edit_settings_uv <= 195) edit_settings_uv += 5;
            else edit_settings_uv = 200;
            break;

        case UI_SETTINGS_OV:
            if (edit_settings_ov == 0) edit_settings_ov = 250;
            else if (edit_settings_ov <= 295) edit_settings_ov += 5;
            else edit_settings_ov = 300;
            break;

        case UI_SETTINGS_OL:
            if (edit_settings_ol <= 20) edit_settings_ol += 5;
            else edit_settings_ol = 25;
            break;

        case UI_SETTINGS_UL:
            if (edit_settings_ul <= 5) edit_settings_ul += 5;
            else edit_settings_ul = 10;
            break;

