Amiya200/stm32_water_tank/Core/Src/screen.c
        case UI_SETTINGS_MAXRUN:
            if (edit_settings_maxrun == 0) edit_settings_maxrun = 10;
            else if (edit_settings_maxrun <= 295) edit_settings_maxrun += 5;
            else edit_settings_maxrun = 300;
            break;

        case UI_SETTINGS_PWRREST:
            edit_settings_pwrrest = (edit_settings_pwrrest + 1) % 3;
            break;

        case UI_SETTINGS_FACTORY:
            edit_settings_factory_yes ^= 1;
            break;

        case UI_DEVSET_EDIT_DATE:
            if (edit_date_field == 0) {
                if (edit_date_dd <= 26) edit_date_dd += 5;
                else edit_date_dd = 31;
            } else if (edit_date_field == 1) {
                if (edit_date_mm <= 7) edit_date_mm += 5;
                else edit_date_mm = 12;
            } else {
                if (edit_date_yyyy <= 2094) edit_date_yyyy += 5;
                else edit_date_yyyy = 2099;
            }
            break;

        case UI_DEVSET_EDIT_TIME:
            if (edit_time_field == 0) {
                if (edit_time_hh <= 18) edit_time_hh += 5;
                else edit_time_hh = 23;
            } else {
                if (edit_time_min <= 54) edit_time_min += 5;
                else edit_time_min = 59;
            }
            break;

        case UI_DEVSET_EDIT_DAY:
            edit_day_idx2 = (uint8_t)((edit_day_idx2 + 1) % 7);
            break;

        default:
            break;
    }
}
void decrease_edit_value(void)
{
    switch(ui)
    {
        case UI_TIMER_EDIT_ON_TIME:
            if (time_edit_field == 0) {
                if (edit_on_h >= 5) edit_on_h -= 5;
                else edit_on_h = 0;
            } else {
                if (edit_on_m >= 5) edit_on_m -= 5;
                else edit_on_m = 0;
            }
            break;
        case UI_TIMER_EDIT_OFF_TIME:
            if (time_edit_field == 0) {
                if (edit_off_h >= 5) edit_off_h -= 5;
                else edit_off_h = 0;
            } else {
                if (edit_off_m >= 5) edit_off_m -= 5;
                else edit_off_m = 0;
            }
            break;
        case UI_TIMER_EDIT_GAP:
            if (edit_gap_min >= 5) edit_gap_min -= 5;
            else edit_gap_min = 0;
            break;
        case UI_AUTO_EDIT_GAP:
            if (edit_auto_gap_s >= 5) edit_auto_gap_s -= 5;
            else edit_auto_gap_s = 0;
            break;
        case UI_AUTO_EDIT_MAXRUN:
            if (edit_auto_maxrun_min >= 5) edit_auto_maxrun_min -= 5;
            else edit_auto_maxrun_min = 0;
            break;
        case UI_AUTO_EDIT_RETRY:
            if (edit_auto_retry >= 5) edit_auto_retry -= 5;
            else edit_auto_retry = 0;
            break;
        case UI_SETTINGS_GAP:
            if (edit_settings_gap_s >= 5) edit_settings_gap_s -= 5;
            else edit_settings_gap_s = 0;
            break;
        case UI_SETTINGS_RETRY:
            if (edit_settings_retry >= 5) edit_settings_retry -= 5;
            else edit_settings_retry = 0;
            break;
        case UI_SETTINGS_OL:
            if (edit_settings_ol >= 5) edit_settings_ol -= 5;
            else edit_settings_ol = 0;
            break;
        case UI_SETTINGS_UL:
            if (edit_settings_ul >= 5) edit_settings_ul -= 5;
            else edit_settings_ul = 0;
            break;
        case UI_SETTINGS_MAXRUN:
            if (edit_settings_maxrun >= 15) edit_settings_maxrun -= 5;
            else edit_settings_maxrun = 0;
            break;
        case UI_DEVSET_EDIT_TIME:
            if (edit_time_field == 0) {
                if (edit_time_hh >= 5) edit_time_hh -= 5;
                else edit_time_hh = 0;
            } else {
                if (edit_time_min >= 5) edit_time_min -= 5;
                else edit_time_min = 0;
            }
            break;
        case UI_DEVSET_EDIT_DAY:
            edit_day_idx2 = (uint8_t)((edit_day_idx2 + 6) % 7);
            break;

        default:
            break;
    }
}
static UiButton decode_button_press(void)
{
    bool sw[4] = {
        Switch_IsPressed(0),
        Switch_IsPressed(1),
        Switch_IsPressed(2),
        Switch_IsPressed(3)
    };
    uint32_t now = HAL_GetTick();
    UiButton out = BTN_NONE;
    for (int i = 0; i < 4; i++)
    {
        if (sw[i] && sw_press_start[i] == 0)
        {
            sw_press_start[i] = now;
            sw_long_issued[i] = false;
        }
        else if (!sw[i] && sw_press_start[i] != 0)
        {
            if (!sw_long_issued[i])
            {
                switch(i){
                    case 0: out = BTN_RESET;  break;
                    case 1: out = BTN_SELECT; break;
                    case 2: out = BTN_UP;     break;
                    case 3: out = BTN_DOWN;   break;
                }
            }
            sw_press_start[i] = 0;
            sw_long_issued[i] = false;
        }
        else if (sw[i] && !sw_long_issued[i])
        {
            if (now - sw_press_start[i] >= LONG_PRESS_MS)
            {
                sw_long_issued[i] = true;
                switch(i){
                    case 0: out = BTN_RESET_LONG;  break;
                    case 1: out = BTN_SELECT_LONG; break;
                    case 2: out = BTN_UP_LONG;     break;
                    case 3: out = BTN_DOWN_LONG;   break;
                }
            }
        }
    }
    return out;
}
void Screen_HandleSwitches(void)
{
    static uint32_t last_repeat_time = 0;
    static bool prev_down_edit = false;

    UiButton b = decode_button_press();
    uint32_t now = HAL_GetTick();

    bool sw_up   = Switch_IsPressed(2);
    bool sw_down = Switch_IsPressed(3);

    /* =========================================================
       GLOBAL ESCAPE
       ========================================================= */
    if (b == BTN_RESET && ui != UI_DASH)
    {
        ui = UI_DASH;
        screenNeedsRefresh = true;
        return;
    }

    /* =========================================================
       COUNTDOWN EDIT MODE
       ========================================================= */
    if (ui == UI_COUNTDOWN_EDIT_MIN)
    {
        if (sw_down)
        {
            if (!prev_down_edit)
            {
                last_repeat_time = now;
                edit_countdown_min++;
                if (edit_countdown_min > 999)
                    edit_countdown_min = 1;
                screenNeedsRefresh = true;
            }
            else if (now - last_repeat_time >= 400)
            {
                last_repeat_time = now;
                edit_countdown_min++;
                if (edit_countdown_min > 999)
                    edit_countdown_min = 1;
                screenNeedsRefresh = true;
            }
        }

        if (!sw_down && prev_down_edit)
        {
            ui = UI_DASH;
            screenNeedsRefresh = true;
        }

        prev_down_edit = sw_down;
        return;
    }
    else
    {
        prev_down_edit = false;
    }

    /* =========================================================
       COUNTDOWN RUN MODE
       ========================================================= */
    if (ui == UI_COUNTDOWN)
    {
        if (b == BTN_DOWN && countdownActive)
        {
            ModelHandle_StopCountdown();
            ui = UI_DASH;
            screenNeedsRefresh = true;
            return;
        }

