Amiya200/stm32_water_tank/Core/Src/screen.c
        if (b == BTN_DOWN_LONG && !countdownActive)
        {
            edit_countdown_min = 1;
            ui = UI_COUNTDOWN_EDIT_MIN;
            screenNeedsRefresh = true;
            return;
        }
    }

    /* =========================================================
       HOLD REPEAT — ONLY FOR EDIT SCREENS
       ========================================================= */
    if ((sw_up || sw_down) &&
        ui != UI_MENU &&
        ui != UI_DEVSET_MENU &&
        ui != UI_TIMER_SLOT_SELECT &&
        ui != UI_DASH &&
        ui != UI_COUNTDOWN &&
        (now - last_repeat_time >= 250))
    {
        last_repeat_time = now;

        if (sw_up)   increase_edit_value();
        if (sw_down) decrease_edit_value();

        screenNeedsRefresh = true;
    }

    if (b == BTN_NONE)
        return;

    refreshInactivityTimer();

    /* =========================================================
       DASHBOARD
       ========================================================= */
    if (ui == UI_DASH)
    {
        switch (b)
        {
            case BTN_RESET:
                ModelHandle_ToggleManual();
                break;

            case BTN_SELECT:
                if (!autoActive)
                    ModelHandle_StartAuto(edit_auto_gap_s,
                                          edit_auto_maxrun_min,
                                          edit_auto_retry);
                else
                    ModelHandle_StopAuto();
                break;

            case BTN_SELECT_LONG:
                ui = UI_MENU;
                menu_idx = 0;
                menu_view_top = 0;
                break;

            case BTN_UP:
                if (!timerActive)
                    ModelHandle_StartTimerNearestSlot();
                else
                    ModelHandle_StopTimer();
                break;

            case BTN_UP_LONG:
                if (!semiAutoActive)
                    ModelHandle_StartSemiAuto();
                else
                    ModelHandle_StopSemiAuto();
                break;

            case BTN_DOWN:
                if (!countdownActive)
                {
                    ModelHandle_StartCountdown(edit_countdown_min * 60);
                    ui = UI_COUNTDOWN;
                }
                else
                {
                    ModelHandle_StopCountdown();
                }
                break;

            case BTN_DOWN_LONG:
                if (!countdownActive)
                {
                    edit_countdown_min = 1;
                    ui = UI_COUNTDOWN_EDIT_MIN;
                }
                break;

            default:
                break;
        }

        screenNeedsRefresh = true;
        return;
    }

    /* =========================================================
       MAIN MENU (NO HOLD REPEAT HERE)
       ========================================================= */
    if (ui == UI_MENU)
    {
        switch (b)
        {
            case BTN_SELECT:
            case BTN_SELECT_LONG:
                menu_select();
                break;

            case BTN_DOWN:
                if (menu_idx < MAIN_MENU_COUNT - 1) menu_idx++;
                break;

            case BTN_UP:
                if (menu_idx > 0) menu_idx--;
                break;

            default:
                break;
        }

        screenNeedsRefresh = true;
        return;
    }

    /* =========================================================
       DEVICE SETUP MENU (NO HOLD REPEAT HERE)
       ========================================================= */
    if (ui == UI_DEVSET_MENU)
    {
        switch (b)
        {
            case BTN_SELECT:
            case BTN_SELECT_LONG:
                menu_select();
                break;

            case BTN_DOWN:
                if (devset_idx < DEVSET_MENU_COUNT - 1) devset_idx++;
                break;

            case BTN_UP:
                if (devset_idx > 0) devset_idx--;
                break;

            default:
                break;
        }

        screenNeedsRefresh = true;
        return;
    }

    /* =========================================================
       TIMER SLOT SELECT (NO HOLD REPEAT HERE)
       ========================================================= */
    if (ui == UI_TIMER_SLOT_SELECT)
    {
        switch (b)
        {
            case BTN_SELECT:
            case BTN_SELECT_LONG:
                menu_select();
                break;

            case BTN_UP:
                if (currentSlot > 0) currentSlot--;
                break;

            case BTN_DOWN:
                if (currentSlot < 5) currentSlot++;
                break;

            default:
                break;
        }

        timer_page = (currentSlot < 2 ? 0 :
                     (currentSlot < 5 ? 1 : 2));

        screenNeedsRefresh = true;
        return;
    }

    /* =========================================================
       GENERIC EDIT SCREENS
       ========================================================= */
    if (ui != UI_DASH && ui != UI_COUNTDOWN)
    {
        switch (b)
        {
            case BTN_UP:
                increase_edit_value();
                break;

            case BTN_DOWN:
                decrease_edit_value();
                break;

            case BTN_SELECT:
                menu_select();
                break;

            default:
                break;
        }

        screenNeedsRefresh = true;
        return;
    }
}

void Screen_Update(void)
{
    uint32_t now = HAL_GetTick();
    bool cursorBlinkActive = (ui == UI_MENU);
    if (cursorBlinkActive && (now - lastCursorToggle >= CURSOR_BLINK_MS))
    {
        cursorVisible = !cursorVisible;
        lastCursorToggle = now;
        draw_menu_cursor();
    }
    if (ui == UI_WELCOME && now - lastLcdUpdateTime >= WELCOME_MS)
    {
        ui = UI_DASH;
        lastLcdUpdateTime = now;
        screenNeedsRefresh = true;
    }
    if (ui != UI_WELCOME &&
        ui != UI_DASH &&
        (now - lastUserAction >= AUTO_BACK_MS))
    {
        ui = UI_DASH;
        screenNeedsRefresh = true;
    }
    if ((ui == UI_DASH || ui == UI_COUNTDOWN) &&
        now - lastLcdUpdateTime >= 1000)
    {
        lastLcdUpdateTime = now;
        screenNeedsRefresh = true;
    }
    if (screenNeedsRefresh || ui != last_ui)
    {
        bool fullRefresh = (ui != last_ui);
        last_ui = ui;
        screenNeedsRefresh = false;
        if (fullRefresh)
            lcd_clear();
        switch(ui)
        {
            case UI_WELCOME:              show_welcome();              break;
            case UI_DASH:                 show_dash();                 break;
            case UI_MENU:                 show_menu();                 break;
            case UI_TIMER_SLOT_SELECT:    show_timer_slot_select();    break;
            case UI_TIMER_EDIT_ON_TIME:   show_edit_on_time();         break;
            case UI_TIMER_EDIT_OFF_TIME:  show_edit_off_time();        break;
            case UI_TIMER_EDIT_DAYS:      show_timer_days();           break;
            case UI_TIMER_EDIT_GAP:       show_timer_gap();            break;
            case UI_TIMER_EDIT_ENABLE:    show_timer_enable();         break;
            case UI_TIMER_EDIT_SUMMARY:   show_timer_summary();        break;
            case UI_AUTO_MENU:            show_auto_menu();            break;
            case UI_AUTO_EDIT_GAP:        show_auto_gap();             break;
            case UI_AUTO_EDIT_MAXRUN:     show_auto_maxrun();          break;
            case UI_AUTO_EDIT_RETRY:      show_auto_retry();           break;
            case UI_SEMI_AUTO:            show_semi_auto();            break;
            case UI_TWIST:                show_twist();                break;
            case UI_TWIST_EDIT_ON:        show_twist_on_sec();         break;
            case UI_TWIST_EDIT_OFF:       show_twist_off_sec();        break;
            case UI_TWIST_EDIT_ON_H:      show_twist_on_h();           break;
            case UI_TWIST_EDIT_ON_M:      show_twist_on_m();           break;
            case UI_TWIST_EDIT_OFF_H:     show_twist_off_h();          break;
            case UI_TWIST_EDIT_OFF_M:     show_twist_off_m();          break;
            case UI_COUNTDOWN:            show_countdown();            break;
            case UI_COUNTDOWN_EDIT_MIN:   show_countdown_edit_min();   break;
            case UI_DEVSET_MENU:          show_devset_menu();          break;
            case UI_SETTINGS_GAP:         show_settings_gap();         break;
            case UI_SETTINGS_RETRY:       show_settings_retry();       break;
            case UI_SETTINGS_UV:          show_settings_uv();          break;
            case UI_SETTINGS_OV:          show_settings_ov();          break;
            case UI_SETTINGS_OL:          show_settings_ol();          break;
            case UI_SETTINGS_UL:          show_settings_ul();          break;
            case UI_SETTINGS_MAXRUN:      show_settings_maxrun();      break;
            case UI_SETTINGS_PWRREST:     show_settings_pwrrest();     break;
            case UI_SETTINGS_FACTORY:     show_settings_factory();     break;
            case UI_DEVSET_EDIT_DATE:     show_devset_edit_date();     break;
            case UI_DEVSET_EDIT_TIME:     show_devset_edit_time();     break;
            case UI_DEVSET_EDIT_DAY:      show_devset_edit_day();      break;
            case UI_ADD_DEVICE_MENU:        show_add_device_menu();        break;
            case UI_ADD_DEVICE_PAIR:        show_add_device_pair();        break;
            case UI_ADD_DEVICE_REMOVE:      show_add_device_remove();      break;
            case UI_ADD_DEVICE_PAIR_DONE:   show_add_device_pair_done();   break;
            case UI_ADD_DEVICE_REMOVE_DONE: show_add_device_remove_done(); break;
            case UI_RESET_CONFIRM:        show_reset_confirm();        break;

            default:
                break;
        }
    }
}
extern void ModelHandle_StartAuto(uint16_t gap_s, uint16_t maxrun_min, uint16_t retry);
extern void ModelHandle_StartTimerNearestSlot(void);
extern void ModelHandle_StopTimer(void);
extern void ModelHandle_StopSemiAuto(void);
extern void ModelHandle_FactoryReset(void);
